## Joins

Joining DataFrames on a common key.

In [57]:
import pandas as pd

zookeeper_df = pd.DataFrame(
    {
        "id": [0, 1, 2, 3, 4, 5],
        "name": ["Alice", "Blake", "Carla", "Danny", "Edgar", "Fiona"],
        "exhibit_id": [0, 1, 1, 2, 1, 0],
        "salary": [63000, 70000, 32000, 85000, 56000, 43000],
    }
)
exhibit_df = pd.DataFrame(
    {
        "id": [0, 1, 2],
        "exhibit_name": ["Savanna Sprawl", "Penguin Park", "Lion's Den"],
    }
)

Just use `join()`:
 - `on=` specifies which key to match from the first (left) DataFrame.
 - `.set_index()` specifies which key to match from the second (right) DataFrame.

In [58]:
zookeeper_df.join(exhibit_df.set_index("id"), on="exhibit_id")

   id   name  exhibit_id  salary    exhibit_name
0   0  Alice           0   63000  Savanna Sprawl
1   1  Blake           1   70000    Penguin Park
2   2  Carla           1   32000    Penguin Park
3   3  Danny           2   85000      Lion's Den
4   4  Edgar           1   56000    Penguin Park
5   5  Fiona           0   43000  Savanna Sprawl

If there are matching column names, specify a suffix to attach for one of the tables during the join.

In [59]:
# now both tables have a column called 'name'
exhibit_df.rename(columns={"exhibit_name": "name"})

# append '_exhibit' to the end of the name column from exhibit_df
zookeeper_df.join(exhibit_df.set_index("id"), on="exhibit_id", rsuffix="_exhibit")

   id   name  exhibit_id  salary    exhibit_name
0   0  Alice           0   63000  Savanna Sprawl
1   1  Blake           1   70000    Penguin Park
2   2  Carla           1   32000    Penguin Park
3   3  Danny           2   85000      Lion's Den
4   4  Edgar           1   56000    Penguin Park
5   5  Fiona           0   43000  Savanna Sprawl